# Taps
tap "oven-sh/bun"

# --- Core ---
brew "git"
brew "btop"
brew "fzf"
brew "zoxide"
brew "ripgrep"
brew "fd"
brew "eza"
brew "bat"
brew "jq"
brew "yq"
brew "direnv"
brew "gh"
brew "lazygit"
brew "tmux"
brew "wget"
brew "gnupg"
brew "openssl@3"
brew "gnu-sed"
brew "gawk"
brew "coreutils"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Node toolchain (Volta manages Node versions)
brew "volta"

# Bun
brew "oven-sh/bun/bun"

# Python helpers (uv installed via script; keep python minimal via uv)
# brew "python@3.12"   # optional if you prefer brew Python

# Prompt
brew "starship"

# Docker CLI (OrbStack provides runtime; CLI is handy either way)
brew "docker"
brew "docker-compose"

# --- Terraform & IaC Tools ---
brew "terraform"
brew "tflint"
brew "terraform-docs"
brew "tfsec"
brew "terragrunt"

# --- Fonts (nice monospace) ---
cask "font-jetbrains-mono-nerd-font"

# --- Apps ---
cask "raycast"
cask "ghostty"
cask "orbstack"
cask "cursor"
